<?php
//取得遊戲列表
if(!function_exists('gameList')) {
    function gameList(){
        $gameList = [
            'Allbet'  => ['gameName' => '歐博真人', 'gameModel' => 'allbet', 3],   //歐博 (3)
            'Sagame'  => ['gameName' => '沙龍真人', 'gameModel' => 'sagame', 9],   //沙龍 (9)
            'DG'      => ['gameName' => 'DG真人', 'gameModel' => 'dg', 12],        //DG真人 (12)
            'wm'      => ['gameName' => 'WM真人', 'gameModel' => 'wm', 33],        //完美真人 (33)
            'Super'   => ['gameName' => 'Super體育', 'gameModel' => 'super', 8],   //super體育 (8)
            'S7PK'    => ['gameName' => '7PK', 'gameModel' => 'S7PK', 22],         //7PK (22)
            'rtg'     => ['gameName' => 'RTG電子', 'gameModel' => 'rtg', 51],      //rtg電子 (51)
            'avia'    => ['gameName' => '泛亞電競', 'gameModel' => 'avia', 36],    //泛亞電競 (35)
            'eg'      => ['gameName' => 'EG捕魚', 'gameModel' => 'eg', 64],        //eg電子 (64)
            'cm'      => ['gameName' => '新濠彩票', 'gameModel' => 'cm', 62],      //新濠彩票 (62)
            //'ssb'  => ['gameName' => '贏家體育', 'gameModel' => 'ssb'],   //贏家 ()
            //'maya'    => ['gameName' => '瑪雅真人', 'gameModel' => 'maya'],     //瑪雅真人 (33)
            //'htpg'    => ['gameName' => '彩播', 'gameModel' => 'htpg'],       //彩播 (41)
            //'pk10'    => ['gameName' => '北京賽車', 'gameModel' => 'pk10'],     //新北京賽車 (31)
            //'s9k168'  => ['gameName' => '9k北京賽車', 'gameModel' => 's9k168'], //9k北京賽車 (26)
            //'bingo'   => ['gameName' => 'Bingo Star', 'gameModel' => 'bingo'],//Bingo (28)
            //'pg'      => ['gameName' => 'PG電子', 'gameModel' => 'pg'],        //PG電子 (6)
            //'vg'      => ['gameName' => 'VG電子', 'gameModel' => 'vg', 38],  //vg電子 (38)
            //'ameba'   => ['gameName' => 'AMEBA', 'gameModel' => 'ameba'],     //AMEBA (27)
            //'hces888' => ['gameName' => '皇朝電競', 'gameModel' => 'hces888', 36],  //皇朝電競 (36)
            //'ssagame'  => ['gameName' => '沙龍真人(舊)', 'gameModel' => 'ssagame'],   //舊沙龍 (9)
            //'sallbet'  => ['gameName' => '歐博真人(舊)', 'gameModel' => 'sallbet'],   //舊歐博 (93)
        ];
        return $gameList;
    }
}

if(!function_exists('rakegameList')) {
    function rakegameList(){
        $gameList = [
            'Allbet'   => ['gameName' => '歐博真人', 'gameModel' => 'allbet', 'type' => 'live'],  //歐博 (3)
            'Sagame'   => ['gameName' => '沙龍真人', 'gameModel' => 'sagame', 'type' => 'live'],  //沙龍 (9)
            'DG'       => ['gameName' => 'DG真人', 'gameModel' => 'dg', 'type' => 'live'],        //DG真人 (12)
            'wm'       => ['gameName' => 'WM真人', 'gameModel' => 'wm', 'type' => 'live'],        //完美真人 (33)
            'Super'    => ['gameName' => 'Super體育', 'gameModel' => 'super', 'type' => 'sport'], //super體育 (8)
            //'Slottery' => ['gameName' => 'Super彩球', 'gameModel' => 'slottery', 20],             //Super彩球 (20)
            'S7PK'     => ['gameName' => '7PK', 'gameModel' => 'S7PK', 'type'=>'egame'],          //7PK (22)
            'avia'     => ['gameName' => '泛亞電競', 'gameModel' => 'avia', 'type'=>'esport'],    //皇朝電競 (35)
            'rtg'      => ['gameName' => 'RTG電子', 'gameModel' => 'rtg', 'type'=>'egame'],       //vg電子 (38)
            'eg'       => ['gameName' => 'EG捕魚', 'gameModel' => 'eg', 64],                      //eg電子 (64)
            'cm'       => ['gameName' => '新濠彩票', 'gameModel' => 'cm', 62],                    //新濠彩票 (62)
            //'vg'      => ['gameName' => 'VG電子', 'gameModel' => 'vg', 38],  //vg電子 (38)
            //'htpg'    => ['gameName' => '彩播', 'gameModel' => 'htpg'],       //彩播 (41)
            //'pk10'    => ['gameName' => '北京賽車', 'gameModel' => 'pk10'],     //新北京賽車 (31)
            //'s9k168'  => ['gameName' => '9k北京賽車', 'gameModel' => 's9k168', 'type'=>'lottery'], //9k北京賽車 (26)
            //'bingo'   => ['gameName' => 'Bingo Star', 'gameModel' => 'bingo', 'type'=>'lottery'],//Bingo (28)
            //'pg'      => ['gameName' => 'PG電子', 'gameModel' => 'pg'],        //PG電子 (6)
            //'maya'    => ['gameName' => '瑪雅真人', 'gameModel' => 'maya', 'type' => 'live'],     //瑪雅真人 (33)
            //'ssb'     => ['gameName' => '贏家體育', 'gameModel' => 'ssb'],   //贏家 ()
            //'ameba'   => ['gameName' => 'AMEBA', 'gameModel' => 'ameba'],     //AMEBA (27)
            //'hces888' => ['gameName' => '皇朝電競', 'gameModel' => 'hces888', 'type'=>'esport'],  //皇朝電競 (36)
            //'ssagame' => ['gameName' => '沙龍真人(舊)', 'gameModel' => 'ssagame'],   //舊沙龍 (9)
            //'sallbet' => ['gameName' => '歐博真人(舊)', 'gameModel' => 'sallbet'],   //舊歐博 (93)
        ];
        return $gameList;
    }
}

//取得遊戲名稱
if(!function_exists('gameName')) {
    function gameName($name = null){
        if(!is_null($name)){
            $gameList = gameList();
            return $gameList[$name]['gameName'];
        }else{
            return null;
        }
    }
}
/*
//取得遊戲代號
if(!function_exists('gameCode')) {
    function gameCode($name = null){
        if(!is_null($name)){
            $gameList = gameList();
            return $gameList[$name]['gameCode'];
        }else{
            return null;
        }
    }
}
*/

//取得遊戲詳細資料
if(!function_exists('gameDetail')) {
    function gameDetail(){
        return $gameDetail = [
            'lobby' => [
                'gameTable' => [
                    2001 => 'A',2002 => 'B',2003 => 'C'
                ],
                'gameResult' => [
                    '' => '自動開獎','B' => '莊贏','P' => '閒贏','T' => '和',
                    'BB' => '莊贏 / 莊對子','BP' => '莊贏 / 閒對子','BBP' => '莊贏 / 對對',
                    'PB' => '閒贏 / 莊對子','PP' => '閒贏 / 閒對子','PBP' => '閒贏 / 對對',
                    'TB' => '和 / 莊對子','TP' => '和 / 閒對子','TBP' => '和 / 對對'
                ],
                'gameCode' => [
                    31 => '百家樂',32 => '輪盤',33 => '骰寶',37 => '妞妞',
                    313 => 'Slot1',315 => '21點',316 => '7PK',
                    317 => 'Slot2',318 => 'Slot3',319 => 'Slot4',
                    312 => '超級21點',324 => '5PK',325 => '加勒比海',
                    1514 => '21點'
                ]
            ],
            's9k168' => [
                'gameResult' => [
                    'W' => '贏','L' => '輸','X' => '未派彩','C' => '註銷'
                ],
                'gameCode' => [
                    'BingoBingo' => '賓果賓果–台灣','BJPK10' => '北京賽車 PK 拾','XYFT' => '幸運飛艇',
                    'JSPK10' => '9K極速PK拾 (75 秒/局)','KPPK10' => '9K高頻PK拾 (180 秒/局)','BJKENO8' => '北京快樂 8','SLFK' => '斯洛伐克',
                    'CQSSC' => '重慶時時彩','TJSSC' => '天津時時彩','XJSSC' => '新彊時時彩','TXSSC' => '騰訊分分彩','QQSSC' => 'QQ 分分彩','TKKENO ' => '東京 1.5 分',
                ]
            ],
            'allbet' => [
                'gameResult' => [
                    101 => '黑桃1',102 => '黑桃2',103 => '黑桃3',104 => '黑桃4',105 => '黑桃5',106 => '黑桃6',107 => '黑桃7',
                    108 => '黑桃8',109 => '黑桃9',110 => '黑桃10',111 => '黑桃J',112 => '黑桃Q',113 => '黑桃K',
                    201 => '紅心1', 202 => '紅心2',203 => '紅心3', 204 => '紅心4',205 => '紅心5',206 => '紅心6',207 => '紅心7',
                    208 => '紅心8',209 => '紅心9',210 => '紅心10',211 => '紅心J',212 => '紅心Q',213 => '紅心K',
                    301 => '梅花1',302 => '梅花2',303 => '梅花3',304 => '梅花4',305 => '梅花5',306 => '梅花6',307 => '梅花7',
                    308 => '梅花8',309 => '梅花9',310 => '梅花10',311 => '梅花J',312 => '梅花Q',313 => '梅花K',
                    401 => '方塊1',402 => '方塊2',403 => '方塊4',404 => '方塊4',405 => '方塊5',406 => '方塊6',407 => '方塊7',
                    408 => '方塊8',409 => '方塊9',410 => '方塊10',411 => '方塊J',412 => '方塊Q',413 => '方塊K',
                    //------------------------------->
                    //百家樂
                    '1001' => '庄','1002' => '閒','1003' => '和','1004' => '大',
                    '1005' => '小','1006' => '庄對','1007' => '閒對','5001' => '超級6',
                    //龍虎
                    '2001' => '龍','2002' => '虎','2003' => '和',
                    //骰寶
                    '3001' => '小','3002' => '單','3003' => '雙','3004' => '大',
                    '3005' => '圍一','3006' => '圍二','3007' => '圍三','3008' => '圍四','3009' => '圍五','3010' => '圍六','3011' => '全圍',
                    '3012' => '對1','3013' => '對2','3014' => '對3','3015' => '對4','3016' => '對5','3017' => '對6',
                    '3018' => '和值：4','3019' => '和值：5','3020' => '和值：6','3021' => '和值：7','3022' => '和值：8',
                    '3023' => '和值：9','3024' => '和值：10','3025' => '和值：11','3026' => '和值：12','3027' => '和值：13',
                    '3028' => '和值：14','3029' => '和值：15','3030' => '和值：16','3031' => '和值：17',
                    '3033' => '牌九式：12','3034' => '牌九式：13','3035' => '牌九式：14','3036' => '牌九式：15','3037' => '牌九式：16',
                    '3038' => '牌九式：23','3039' => '牌九式：24','3040' => '牌九式：25','3041' => '牌九式：26','3042' => '牌九式：34',
                    '3043' => '牌九式：35','3044' => '牌九式：36','3045' => '牌九式：45','3046' => '牌九式：46','3047' => '牌九式：56',
                    '3048' => '單骰：1','3049' => '單骰：2','3050' => '單骰：3','3051' => '單骰：4','3052' => '單骰：5','3053' => '單骰：6',
                    //輪盤
                    '4001' => '小','4002' => '雙','4003' => '紅','4004' => '黑','4005' => '單','4006' => '大',
                    '4007' => '第一打','4008' => '第二打','4009' => '第三打','4010' => '第一列','4011' => '第二列','4012' => '第三列',
                    '4013' => '直接注：0','4014' => '直接注：1','4015' => '直接注：2','4016' => '直接注：3','4017' => '直接注：4',
                    '4018' => '直接注：5','4019' => '直接注：6','4020' => '直接注：7','4021' => '直接注：8','4022' => '直接注：9',
                    '4023' => '直接注：10','4024' => '直接注：11','4025' => '直接注：12','4026' => '直接注：13','4027' => '直接注：14',
                    '4028' => '直接注：15','4029' => '直接注：16','4030' => '直接注：17','4031' => '直接注：18','4032' => '直接注：19',
                    '4033' => '直接注：20','4034' => '直接注：21','4035' => '直接注：22','4036' => '直接注：23','4037' => '直接注：24',
                    '4038' => '直接注：25','4039' => '直接注：26','4040' => '直接注：27','4041' => '直接注：28','4042' => '直接注：29',
                    '4043' => '直接注：30','4044' => '直接注：31','4045' => '直接注：32','4046' => '直接注：33','4047' => '直接注：34',
                    '4048' => '直接注：35','4049' => '直接注：36',
                    '4050' => '三數：(0/1/2)','4051' => '三數：(0/2/3)','4052' => '四數：(0/1/2/3)',

                    "4053" => '分注：(0/1)',"4054" => '分注：(0/2)',"4055" => '分注：(0/3)',

                    "4056" => '分注：(1/2)',"4057" => '分注：(2/3)',"4058" => '分注：(4/5)',"4059" => '分注：(5/6)',"4060" => '分注：(7/8)',"4061" => '分注：(8/9)',
                    "4062" => '分注：(10/11)',"4063" => '分注：(11/12)',"4064" => '分注：(13/14)',"4065" => '分注：(14/15)',
                    "4066" => '分注：(16/17)',"4067" => '分注：(17/18)',"4068" => '分注：(19/20)',"4069" => '分注：(20/21)',
                    "4070" => '分注：(22/23)',"4071" => '分注：(23/24)',"4072" => '分注：(25/26)',"4073" => '分注：(26/27)',
                    "4074" => '分注：(28/29)',"4075" => '分注：(29/30)',"4076" => '分注：(31/32)',"4077" => '分注：(32/33)',"4078" => '分注：(34/35)',"4079" => '分注：(35/36)',

                    "4080" => '分注：(1/4)',"4081" => '分注：(4/7)',"4082" => '分注：(7/10)',
                    "4083" => '分注：(10/13)',"4084" => '分注：(13/16)',"4085" => '分注：(16/19)',
                    "4086" => '分注：(19/22)',"4087" => '分注：(22/25)',"4088" => '分注：(25/28)',
                    "4089" => '分注：(28/31)',"4090" => '分注：(31/34)',

                    "4091" => '分注：(2/5)',"4092" => '分注：(5/8)',"4093" => '分注：(8/11)',
                    "4094" => '分注：(11/14)',"4095" => '分注：(14/17)',"4096" => '分注：(17/20)',
                    "4097" => '分注：(20/23)',"4098" => '分注：(23/26)',"4099" => '分注：(26/29)',

                    "4100" => '分注：(29/32)',"4101" => '分注：(32/35)',
                    "4102" => '分注：(3/6)',"4103" => '分注：(6/9)',"4104" => '分注：(9/12)',
                    "4105" => '分注：(12/15)',"4106" => '分注：(15/18)',"4107" => '分注：(18/21)',
                    "4108" => '分注：(21/24)',"4109" => '分注：(24/27)',"4110" => '分注：(27/30)',
                    "4111" => '分注：(30/33)',"4112" => '分注：(33/36)',

                    "4113" => '角注：(1/5)',"4114" => '角注：(2/6)',"4115" => '角注：(4/8)',"4116" => '角注：(5/9)',"4117" => '角注：(7/11)',"4118" => '角注：(8/12)',
                    "4119" => '角注：(10/14)',"4120" => '角注：(11/15)',"4121" => '角注：(13/17)',"4122" => '角注：(14/18)', "4123" => '角注：(16/20)',"4124" => '角注：(17/21)',
                    "4125" => '角注：(19/23)',"4126" => '角注：(20/24)',"4127" => '角注：(22/26)',"4128" => '角注：(23/27)',"4129" => '角注：(25/29)',"4130" => '角注：(26/30)',
                    "4131" => '角注：(28/32)',"4132" => '角注：(29/33)', "4133" => '角注：(31/35)',"4134" => '角注：(32/36)',
                    
                    "4135" => '街注：(1~3)',"4136" => '街注：(4~6)',"4137" => '街注：(7~9)',"4138" => '街注：(10~12)',
                    "4139" => '街注：(13~14)',"4140" => '街注：(16~18)',"4141" => '街注：(19~21)',"4142" => '街注：(22~24)',
                    "4143" => '街注：(25~27)',"4144" => '街注：(28~30)',"4145" => '街注：(31~33)',"4146" => '街注：(34~36)',

                    "4147" => '線注：(1~6)',"4148" => '線注：(4~9)',"4149" => '線注：(7~12)',
                    "4150" => '線注：(10~15)',"4151" => '線注：(13~18)',"4152" => '線注：(16~21)',
                    "4153" => '線注：(19~24)',"4154" => '線注：(22~27)',"4155" => '線注：(28~33)',"4156" => '線注：(31~36)',"4157" => '線注：(25~30)',

                    "6001" => '好運注(1) 80x',"6002" => '好運注(2) 18x',"6003" => '好運注(3) 3x',"6004" => '好運注(4) 1x',"6005" => '好運注(5) 3x',"6006" => '好運注(6) 18x',"6007" => '好運注(7) 80x',

                    "7000" => '座位 1–普通',"7001" => '座位 1–保險',"7002" => '座位 1–雙倍',"7003" => '座位 1–分牌',"7004" => '座位 1–21+3',"7005" => '座位 1–完美對子',
                    "7010" => '座位 2–普通',"7011" => '座位 2–保險',"7012" => '座位 2–雙倍',"7013" => '座位 2–分牌',"7014" => '座位 2–21+3',"7015" => '座位 2–完美對子',
                    "7020" => '座位 3–普通',"7021" => '座位 3–保險',"7022" => '座位 3–雙倍',"7023" => '座位 3–分牌',"7024" => '座位 3–21+3',"7025" => '座位 3–完美對子',
                    "7030" => '座位 4–普通',"7031" => '座位 4–保險',"7032" => '座位 4–雙倍',"7033" => '座位 4–分牌',"7034" => '座位 4–21+3',"7035" => '座位 4–完美對子',
                    "7040" => '座位 5–普通',"7041" => '座位 5–保險',"7042" => '座位 5–雙倍',"7043" => '座位 5–分牌',"7044" => '座位 5–21+3',"7045" => '座位 5–完美對子',
                    "7050" => '座位 6–普通',"7051" => '座位 6–保險',"7052" => '座位 6–雙倍',"7053" => '座位 6–分牌',"7054" => '座位 6–21+3',"7055" => '座位 6–完美對子',
                    "7060" => '座位 7–普通',"7061" => '座位 7–保險',"7062" => '座位 7–雙倍',"7063" => '座位 7–分牌',"7064" => '座位 7–21+3',"7065" => '座位 7–完美對子',

                    "7100" => '搭注–座位 1–普通',"7101" => '搭注–座位 1–保險',"7102" => '搭注–座位 1–雙倍',"7103" => '搭注–座位 1–分牌',"7104" => '搭注–座位 1–21+3',"7105" => '搭注–座位 1–完美對子',
                    "7110" => '搭注–座位 2–普通',"7111" => '搭注–座位 2–保險',"7112" => '搭注–座位 2–雙倍',"7113" => '搭注–座位 2–分牌',"7114" => '搭注–座位 2–21+3',"7115" => '搭注–座位 2–完美對子',
                    "7120" => '搭注–座位 3–普通',"7121" => '搭注–座位 3–保險',"7122" => '搭注–座位 3–雙倍',"7123" => '搭注–座位 3–分牌',"7124" => '搭注–座位 3–21+3',"7125" => '搭注–座位 3–完美對子',
                    "7130" => '搭注–座位 4–普通',"7131" => '搭注–座位 4–保險',"7132" => '搭注–座位 4–雙倍',"7133" => '搭注–座位 4–分牌',"7134" => '搭注–座位 4–21+3',"7135" => '搭注–座位 4–完美對子',
                    "7140" => '搭注–座位 5–普通',"7141" => '搭注–座位 5–保險',"7142" => '搭注–座位 5–雙倍',"7143" => '搭注–座位 5–分牌',"7144" => '搭注–座位 5–21+3',"7145" => '搭注–座位 5–完美對子',
                    "7150" => '搭注–座位 6–普通',"7151" => '搭注–座位 6–保險',"7152" => '搭注–座位 6–雙倍',"7153" => '搭注–座位 6–分牌',"7154" => '搭注–座位 6–21+3',"7155" => '搭注–座位 6–完美對子',
                    "7160" => '搭注–座位 7–普通',"7161" => '搭注–座位 7–保險',"7162" => '搭注–座位 7–雙倍',"7163" => '搭注–座位 7–分牌',"7164" => '搭注–座位 7–21+3',"7165" => '搭注–座位 7–完美對子',

                ],
                'gameCode' => [
                    101 => '普通百家樂',
                    102 => 'VIP百家樂',
                    103 => '快速百家樂',
                    104 => '競咪百家樂',
                    106 => '聚寶百家樂',
                    201 => '骰寶',
                    301 => '龍虎',
                    401 => '輪盤',
                    501 => '歐洲廳百家樂',
                    601 => '歐洲廳輪盤',
                    701 => '歐洲廳21點'
                ]
            ],
            'sagame' => [
                'gameResult' => [
                    //定義百家樂投注類型
                    'bac0' => '合','bac1' => '閒','bac2' => '莊','bac3' => '閒對','bac4' => '莊對',
                    'bac5' => '閒單點','bac6' => '莊單點','bac7' => '總單點','bac8' => '閒雙點','bac9' => '莊雙點','bac10' => '總雙點',
                    'bac11' => '閒點小','bac12' => '莊點小','bac13' => '總點小','bac14' => '閒點大','bac15' => '莊點大','bac16' => '總點大',
                    'bac17' => '閒牌小','bac18' => '莊牌小','bac19' => '總牌小','bac20' => '閒牌大','bac21' => '莊牌大','bac22' => '總牌大',
                    'bac25' => '超級六和','bac26' => '超級六閒贏','bac27' => '超級六莊贏','bac28' => '超級六閒對','bac29' => '超級六莊對',
                    'bac30' => '超級六','bac31' => '超級百家樂和','bac32' => '超級百家樂閒贏','bac33' => '超級百家樂莊贏','bac34' => '超級百家樂閒對','bac35' => '超級百家樂莊對',
                    'bac36' => '閒例牌','bac37' => '莊例牌','bac38' => '超級百家樂閒例牌','bac39' => '超級百家樂莊例牌','bac40' => '超級六閒例牌','bac41' => '超級六莊例牌',
                    'bac42' => '牛牛百家樂閒贏','bac43' => '牛牛百家樂莊贏',
                    //骰寶
                    'sicbo0' => '小','sicbo1' => '大','sicbo2' => '單','sicbo3' => '雙',
                    'sicbo4' => '三軍1','sicbo5' => '三軍2','sicbo6' => '三軍3','sicbo7' => '三軍4','sicbo8' => '三軍5','sicbo9' => '三軍6',
                    'sicbo10' => '圍一','sicbo11' => '圍二','sicbo12' => '圍三','sicbo13' => '圍四','sicbo14' => '圍五','sicbo15' => '圍六','sicbo16' => '全圍',
                    'sicbo17' => '4點','sicbo18' => '5點','sicbo19' => '6點','sicbo20' => '7點','sicbo21' => '8點','sicbo22' => '9點','sicbo23' => '10點','sicbo24' => '11點',
                    'sicbo25' => '12點','sicbo26' => '13點','sicbo27' => '14點','sicbo28' => '15點','sicbo29' => '16點','sicbo30' => '17點',
                    'sicbo31' => '長牌12','sicbo32' => '長牌13','sicbo33' => '長牌14','sicbo34' => '長牌15','sicbo35' => '長牌16','sicbo36' => '長牌23','sicbo37' => '長牌24',
                    'sicbo38' => '長牌25','sicbo39' => '長牌26','sicbo40' => '長牌34','sicbo41' => '長牌35','sicbo42' => '長牌36','sicbo43' => '長牌45','sicbo44' => '長牌46','sicbo45' => '長牌56',
                    'sicbo46' => '短牌1','sicbo47' => '短牌2','sicbo48' => '短牌3','sicbo49' => '短牌4','sicbo50' => '短牌5','sicbo51' => '短牌6',
                    'sicbo52' => '三全單','sicbo53' => '兩單一雙','sicbo54' => '兩雙一單','sicbo55' => '三全雙',
                    'sicbo56' => '1,2,3,4','sicbo57' => '2,3,4,5','sicbo58' => '2,3,5,6','sicbo59' => '3,4,5,6',
                    'sicbo60' => '112','sicbo61' => '113','sicbo62' => '114','sicbo63' => '115','sicbo64' => '116',
                    'sicbo65' => '221','sicbo66' => '223','sicbo67' => '224','sicbo68' => '225','sicbo69' => '226',
                    'sicbo70' => '331','sicbo71' => '332','sicbo72' => '334','sicbo73' => '335','sicbo74' => '336',
                    'sicbo75' => '441','sicbo76' => '442','sicbo77' => '443','sicbo78' => '445','sicbo79' => '446',
                    'sicbo80' => '551','sicbo81' => '552','sicbo82' => '553','sicbo83' => '554','sicbo84' => '556',
                    'sicbo85' => '661','sicbo86' => '662','sicbo87' => '663','sicbo88' => '664','sicbo89' => '665',
                    'sicbo90' => '126','sicbo91' => '135','sicbo92' => '234','sicbo93' => '256','sicbo94' => '346',
                    'sicbo95' => '123','sicbo96' => '136','sicbo97' => '145','sicbo98' => '235','sicbo99' => '356',
                    'sicbo100' => '124','sicbo101' => '146','sicbo102' => '236','sicbo103' => '245','sicbo104' => '456',
                    'sicbo105' => '125','sicbo106' => '134','sicbo107' => '156','sicbo108' => '246','sicbo109' => '345',
                    
                    //番推
                    'ftan0' => '單','ftan1' => '雙',
                    'ftan2' => '1正','ftan3' => '2正','ftan4' => '3正','ftan5' => '4正',
                    'ftan6' => '1番','ftan7' => '2番','ftan8' => '3番','ftan9' => '4番',
                    'ftan10' => '1念2','ftan11' => '1念3','ftan12' => '1念4','ftan13' => '2念1','ftan14' => '2念3','ftan15' => '2念4',
                    'ftan16' => '3念1','ftan17' => '3念2','ftan18' => '3念4','ftan19' => '4念1','ftan20' => '4念2','ftan21' => '4念3',
                    'ftan22' => '12角','ftan23' => '14角','ftan24' => '23角','ftan25' => '34角',
                    'ftan26' => '23一通','ftan27' => '24一通','ftan28' => '34一通','ftan29' => '13二通','ftan30' => '14二通',
                    'ftan31' => '34二通','ftan32' => '12三通','ftan33' => '14三通','ftan34' => '24三通','ftan35' => '12四通',
                    'ftan36' => '13四通','ftan37' => '23四通','ftan38' => '123中','ftan39' => '124中','ftan40' => '134中','ftan41' => '234中',


                    'rot0' => '0','rot1' => '1','rot2' => '2','rot3' => '3','rot4' => '4','rot5' => '5','rot6' => '6','rot7' => '7','rot8' => '8','rot9' => '9',
                    'rot10' => '10','rot11' => '11','rot12' => '12','rot13' => '13','rot14' => '14','rot15' => '15','rot16' => '16','rot17' => '17','rot118' => '18','rot19' => '19',
                    'rot20' => '20','rot21' => '21','rot22' => '22','rot23' => '23','rot24' => '24','rot25' => '25','rot26' => '26','rot27' => '27','rot228' => '28','rot29' => '29',
                    'rot30' => '30','rot31' => '31','rot32' => '32','rot33' => '33','rot34' => '34','rot35' => '35','rot36' => '36',
                    'rot37' => '0,1','rot38' => '0,2','rot39' => '0,3','rot40' => '1,2','rot41' => '1,4','rot42' => '2,3','rot43' => '2,5',
                    'rot44' => '3,6','rot45' => '4,5','rot46' => '4,7','rot47' => '5,6','rot48' => '5,8','rot49' => '6,9','rot50' => '7,8',
                    'rot51' => '7,10','rot52' => '8,9','rot53' => '8,11','rot54' => '9,12','rot55' => '10,11','rot56' => '10,13','rot57' => '11,12',
                    'rot58' => '11,14','rot59' => '12,15','rot60' => '13,14','rot61' => '13,16','rot62' => '14,15','rot63' => '14,17','rot64' => '15,18',
                    'rot65' => '16,17','rot66' => '16,19','rot67' => '17,18','rot68' => '17,20','rot69' => '18,21','rot70' => '19,20','rot71' => '19,22',
                    'rot72' => '20,21','rot73' => '20,23','rot74' => '21,24','rot75' => '22,23','rot76' => '22,25','rot77' => '23,24','rot78' => '23,26',
                    'rot79' => '24,27','rot80' => '25,26','rot81' => '25,28','rot82' => '26,27','rot83' => '26,29','rot84' => '27,30','rot85' => '28,29',
                    'rot86' => '28,31','rot87' => '29,30','rot88' => '29,32','rot89' => '30,33','rot90' => '31,32','rot91' => '31,34','rot92' => '32,33',
                    'rot93' => '32,35','rot94' => '33,36','rot95' => '34,35','rot96' => '35,36','rot97' => '0,1,2','rot98' => '0,2,3','rot99' => '1,2,3',
                    'rot100' => '4,5,6','rot101' => '7,8,9','rot102' => '10,11,12','rot103' => '13,14,15','rot104' => '16,17,18','rot105' => '19,20,21','rot106' => '22,23,24',
                    'rot107' => '25,26,27','rot108' => '28,29,30','rot109' => '31,32,33','rot110' => '34,35,36','rot111' => '1,2,4,5','rot112' => '2,3,5,6','rot113' => '4,5,7,8','rot114' => '5,6,8,9',
                    'rot115' => '7,8,10,11','rot116' => '8,9,11,12','rot117' => '10,11,13,14','rot118' => '11,12,14,15','rot119' => '13,14,16,17','rot120' => '14,15,17,18','rot121' => '16,17,19,20','rot122' => '17,18,20,21',
                    'rot123' => '19,20,22,23','rot124' => '20,21,23,24','rot125' => '22,23,25,26','rot126' => '23,24,26,27','rot127' => '25,26,28,29','rot128' => '26,27,29,30','rot129' => '28,29,31,32','rot130' => '29,30,32,33',
                    'rot131' => '31,32,34,35','rot132' => '32,33,35,36',
                    'rot133' => '1,2,3,4,5,6','rot134' => '4,5,6,7,8,9','rot135' => '7,8,9,10,11,12','rot136' => '10,11,12,13,14,15','rot137' => '13,14,15,16,17,18','rot138' => '16,17,18,19,20,21',
                    'rot139' => '19,20,21,22,23,24','rot140' => '22,23,24,25,26,27','rot141' => '25,26,27,28,29,30','rot142' => '28,29,30,31,32,33','rot143' => '31,32,33,34,35,36',
                    'rot144' => '第一列​ ​ (1~12)','rot145' => '第二列​ ​ (13~24)','rot146' => '第三列​ ​ (25~36)','rot147' => '第一行​ ​ (1~34)','rot148' => '第二行​ ​ (2~35)','rot149' => '第三行​ ​ (3~36)',
                    'rot150' => '1~18​ ​ ( 小)','rot151' => '19~36​ ​ ( 大)',
                    'rot152' => '單','rot153' => '雙','rot154' => '紅','rot155' => '黑','rot156' => '0,1,2,3',

                    //龍虎
                    'dtx0' => '合','dtx1' => '龍','dtx2' => '虎',
                ],
                'gameCode' => [
                    'bac' => '百家樂',
                    'dtx' => '龍虎',
                    'sicbo' => '骰寶',
                    'rot' => '輪盤',
                    'ftan' => '番擹',
                    'slot' => '電子遊藝',
                    'minigame' => '小遊戲',
                    'multiplayer' => '多人遊戲',
                ]
            ],
        ];
    }
}
//取得遊戲桌號
if(!function_exists('gameTable')) {
    function gameTable($name = null, $table = null){
        $gameDetail = gameDetail();

        if(!is_null($name) && !is_null($table)){
            return $gameDetail[$name]['gameTable'][$table];
        }elseif(!is_null($name) && is_null($table)){
            return $gameDetail[$name]['gameTable'];
        }else{
            return null;
        }
    }
}
//取得遊戲結果
if(!function_exists('gameResult')) {
    function gameResult($name = null, $result = null){
        $gameDetail = gameDetail();
        if(!is_null($name) && !is_null($result)){
            return $gameDetail[$name]['gameResult'][$result];
        }elseif(!is_null($name) && is_null($result)){
            return $gameDetail[$name]['gameResult'];
        }else{
            return null;
        }
    }
}
//取得遊戲名稱
if(!function_exists('gameCode')) {
    function gameCode($name = null, $code = null){
        $gameDetail = gameDetail();
        if(!is_null($name) && !is_null($code)){
            return $gameDetail[$name]['gameCode'][$code];
        }elseif(!is_null($name) && is_null($code)){
            return $gameDetail[$name]['gameCode'];
        }else{
            return null;
        }
    }
}